app/controllers/books_controller.rb

INSERT INTO "books" ("author", "created_at", "read", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Samantha Shannon"], ["created_at", "2014-08-30 01:00:55.611086"], ["read", "f"], ["title", "The Bone Season"], ["updated_at", "2014-08-30 01:00:55.611086"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save